# 델타 이동 or 델타 탐색
# 4방위를 탐색 하는게 델타 탐색

# 델타_y = [0, 0, 1, -1]
# 델타_x = [1, -1, 0, 0]


델타_y = [-1, -1, -1, 0, 0, 1, 1, 1]
델타_x = [1, 0, 1, -1, 1, -1, 0, 1]
y, x = 1, 3
지뢰 = "*"
빈공간 = "."
# for d in range(4):
#     탐색_y = y + 델타_y[d]
#     탐색_x = x + 델타_x[d]
    
#     if 게임보드[탐색_y][탐색_x] == 지뢰:
#         지뢰수 += 1
# 결과보드[y][x] = 지뢰수


# 이중반복문
for y in range(8):
    for x in range(8):
        print(y,x)
        for d in range(8):
            탐색_y = y + 델타_y[d]
            탐색_x = x + 델타_x[d]
            print(탐색_y,탐색_x)
        break
    break